
# taps
tap "homebrew/bundle"
tap "homebrew/services"

tap "koekeishiya/formulae"
tap "pkgxdev/made"

brew "noti" # utility to display notifications from scripts
brew "trash" # rm, but put in the trash rather than completely delete

# Applications
cask "kitty" # a better terminal emulator
cask "imageoptim" # a tool to optimize images
cask "1password/tap/1password-cli"
cask "wezterm" # a better terminal emulator

# Aerospace
cask "nikitabobko/tap/aerospace"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-cascadia-mono"
cask "font-symbols-only-nerd-font"
cask "font-recursive-code"
cask "font-monaspace"

cask "minisim" # A simple way to launch mobile simulators

# Packages

tap "homebrew/bundle"

# Packages
brew "git" # Git version control (latest version)
brew "git-delta" # Git diff viewer
brew "git-extras" # Git extras
brew "glow" # Markdown viewer
brew "neovim" # A better vim
brew "python" # python (latest)
brew "wget" # HTTP client
brew "tree" # Directory listing
brew "ripgrep" # Search inside files
brew "zsh" # zsh (latest)


cask "raycast" # Raycast, a blazingly fast, completely free modern launcher
cask "notion" # Notion, a powerful workspace for your notes, tasks, wikis, and databases