tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "microsoft/mssql-release"
tap "nikitabobko/tap"
tap "pkgxdev/made"
brew "zstd"
brew "jpeg-xl"
brew "grpc"
brew "llvm"
brew "apache-arrow"
brew "harfbuzz"
brew "openjdk@17"
brew "apache-spark"
brew "astro"
brew "aztfexport"
brew "azure-cli"
brew "black"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "docker-compose"
brew "git"
brew "git-delta"
brew "git-extras"
brew "glow"
brew "graphviz"
brew "openjdk@11"
brew "hadoop"
brew "ipython", link: false
brew "node"
brew "jupyterlab", link: false
brew "minikube"
brew "mypy"
brew "neovim"
brew "noti"
brew "openjdk"
brew "php"
brew "poetry", link: false
brew "putty"
brew "python-lsp-server"
brew "python@3.11"
brew "ripgrep"
brew "stow"
brew "trash"
brew "tree"
brew "virtualenv", link: false
brew "wget"
brew "zsh"
brew "hashicorp/tap/terraform"
brew "microsoft/mssql-release/msodbcsql18"
cask "1password-cli"
cask "aerospace"
cask "airflow"
cask "anaconda"
cask "font-cascadia-mono"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-monaspace"
cask "font-recursive-code"
cask "font-symbols-only-nerd-font"
cask "kitty"
cask "minisim"
cask "openlens"
cask "postman"
cask "wezterm"
